In [27]:
import pandas as pd
import numpy as np

In [28]:
d = pd.read_csv("C://Users//KIIT//Desktop//train.csv")

In [29]:
dt = pd.read_csv("C://Users//KIIT//Desktop//test.csv")
Train = pd.DataFrame(d)
Test = pd.DataFrame(dt)

In [31]:
m = Train.Age.mean()
p = Test.Age.mean()

In [45]:
Trai = Train['Age'].fillna(29.6, inplace = True)

In [6]:
Test3.shape

(332, 11)

In [7]:
Train2 = Train2.drop("Cabin", axis = 1)
Test3 = Test3.drop("Cabin", axis = 1)

In [8]:
Train2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [9]:
Test3 = Test3.drop(["PassengerId","Ticket"], axis = 1)
Test3.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q
1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S
2,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q
3,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S

In [10]:
one_hot_sex = pd.get_dummies(Train2['Sex'])
one_hot_embarked = pd.get_dummies(Train2['Embarked'])

# drop Sex and Embarked
Train2 = Train2.drop(columns = ['Sex', 'Embarked'])

# Join the encoded df
Train3 = Train2.join(one_hot_sex).join(one_hot_embarked)
Train3.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,female,male,C,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,0,1,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,1,0,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,1,0,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,1,0,0,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,0,1,0,0,1

In [11]:
Test3.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        1
Embarked    0
dtype: int64

In [12]:
Test4 = Test3.dropna(subset = ['Fare'])

In [13]:
one_hot_sex1 = pd.get_dummies(Test4['Sex'])
one_hot_embarked1 = pd.get_dummies(Test4['Embarked'])

# drop Sex and Embarked
Test4 = Test4.drop(columns = ['Sex', 'Embarked'])

# Join the encoded df
Test11 = Test4.join(one_hot_sex1).join(one_hot_embarked1)

In [14]:
y = Train3.Survived
Train4 = Train3.drop("Survived" , axis = 1)
Train5 = Train4.drop(['Name','Ticket'] , axis = 1)

In [15]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(Train5, y, test_size = 0.2)

In [16]:
from sklearn.preprocessing import StandardScaler
from sklearn.decomposition import PCA
from sklearn.pipeline import make_pipeline
from sklearn.linear_model import LogisticRegression
%matplotlib inline

In [17]:
from sklearn.model_selection import GridSearchCV
from sklearn.svm import SVC

pipe_svc = make_pipeline(StandardScaler(), SVC(random_state = 1))
param_range = [0.0001, 0.001, 0.01, 0.1, 1.0, 10.0, 100.0]
param_grid = [{'svc__C':param_range, 'svc__kernel':['linear']}, {'svc__C':param_range, 'svc__gamma':param_range, 'svc__kernel':['rbf']}]

In [18]:
GS = GridSearchCV(estimator = pipe_svc, param_grid = param_grid, scoring = 'accuracy', cv = 10, n_jobs = 2)
GS = GS.fit(X_train, y_train)
print(GS.best_score_)
print(GS.best_params_)

0.8073555166374781
{'svc__C': 100.0, 'svc__gamma': 0.01, 'svc__kernel': 'rbf'}

C:\Users\KIIT\Anaconda3\lib\site-packages\sklearn\model_selection\_search.py:813: DeprecationWarning: The default of the `iid` parameter will change from True to False in version 0.22 and will be removed in 0.24. This will change numeric results when test-set sizes are unequal.
  DeprecationWarning)

In [19]:
clf = GS.best_estimator_
clf1 = clf.fit(X_test, y_test)
print('test Accuracy : %.3f' % clf1.score(X_test, y_test))

test Accuracy : 0.832